# CreateCustomControl

## Description
Creates a layout manager control in a VectorScript to be used in conjunction with GS_OverrideControl in an external dialog handler.

```pascal
PROCEDURE CreateCustomControl(
				dialogID    : LONGINT;
				componentID : LONGINT;
				iWidth      : INTEGER;
				iHeight     : INTEGER);
```

```python
def vs.CreateCustomControl(dialogID, componentID, iWidth, iHeight):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|dialogID|LONGINT|   |
|componentID|LONGINT|   |
|iWidth|INTEGER|   |
|iHeight|INTEGER|   |

## Version
Availability: from VectorWorks 13.0

## Category
* Dialogs - Modern